# ExternalApplicationArrayIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalApplicationArrayIterator Class
Members See Also
---
An iterator to an array of IExternalApplication objects..
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class ExternalApplicationArrayIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class ExternalApplicationArrayIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class ExternalApplicationArrayIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.UI..::..ExternalApplicationArrayIterator
# See Also
ExternalApplicationArrayIterator Members
Autodesk.Revit.UI Namespace